Revit 2023 API
AreaBasedLoadData Members
The AreaBasedLoadData type exposes the following members.
Methods
Name | Description
AddElectricalLoadArea
 Adds electrical load area into the area based load.
Dispose |  (Inherited from ZoneElementDomainData.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetElectricalLoadAreas
 Gets electrical load areas which the area based load includes.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
RemoveElectricalLoadArea
 Removes electrical load area from the area based load.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ApparentLoad
 The electrical apparent load of the area based load.
ApparentPowerDensity
 The apparent power density of the area based load.
AreaBasedLoadType
 The electrical area based load type of the area based load.
Current
 The current of the area based load .
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ZoneElementDomainData.)
LoadClassification
 The load classification of the area based load.
LoadDensity
 The load density of the area based load.
LoadType
 The load type of the area based load.
PhasesNumber
 The Phases Number of the area based load.
PowerFactor
 The power factor of the area based load.
TrueLoad
 The electrical true load of the area based load.
Voltage
 The voltage of the area based load.
See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace